04_Rails/todos/app/controllers/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @todo = Todo.find(params[:id])

INSERT INTO "todos" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ぽおおおおおお"], ["description", "いいいいいい"], ["created_at", "2021-03-09 15:38:50.696157"], ["updated_at", "2021-03-09 15:38:50.696157"]]
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 2]]
---
  def destroy
    todo = Todo.find(params[:id])
    todo.destroy

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @todo = Todo.find(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "description" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["description", "adsfadsfadsfadsfadsfadsfadsfadsf"], ["updated_at", "2021-03-09 15:38:13.651277"], ["id", 2]]
---
  def update
    todo = Todo.find(params[:id])
    todo.update!(todo_params)