app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    @task = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4
---
    task = Task.find(params[:id])
    task.update!(task_params)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "テスト"], ["description", "テスト１１１１"], ["created_at", "2021-01-24 22:15:48.866294"], ["updated_at", "2021-01-24 22:15:48.866294"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 2]]
---
    task = Task.find(params[:id])
    task.destroy